snlkuharlocal/src/Enums/ВидыОперацийИСМП/ВидыОперацийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийИСМП</name>
  <enumValues>
    <name>Агрегация</name>
  </enumValues>
  <enumValues>
    <name>АТК</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_Импорт</name>
  </enumValues>
  <enumValues>
    <name>ВводВОборот_МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_БезвозмезднаяПередача</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ВозвратФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ДистанционнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Прочее</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ИспользованиеДляСобственныхНужд</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Конфискация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоГосударственномуКонтракту</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоОбразцам</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ПродажаПоСделкеСГосударственнойТайной</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_РозничнаяПродажа</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ТрансграничнаяПродажаВСтраныЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Уничтожение</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утилизация</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_Утрата</name>
  </enumValues>
  <enumValues>
    <name>ВыводИзОборота_ЭкспортЗаПределыСтранЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ДистанционнаяПродажа</name>
    <comment>Возврат при дистанционном способе продажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляПроизводственныхЦелей</name>
    <comment>Возврат товара, выведенного изоборота  для  производственных целей</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ИспользованиеДляСобственныхНужд</name>
    <comment>Возврат товара, выведенного из оборота для собственных нужд</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПриобретениеНеДляПерепродажи</name>
    <comment>Возврат в оборот возврат приобретение не для перепродажи</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_ПродажаЧерезВендинг</name>
    <comment>Возврат товара, выведенного из оборота для продажи  через  вендинговый аппарат</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратВОборот_Возврат_РозничнаяРеализация</name>
    <comment>Возврат при розничной реализации</comment>
  </enumValues>
  <enumValues>
    <name>ОтгрузкаВЕАЭС</name>
    <comment>Отгрузка в ЕАЭС</comment>
  </enumValues>
  <enumValues>
    <name>РасформированиеУпаковки</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Испорчен</name>
    <comment>Списание не нанесееных КМ. Испорчен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Уничтожен</name>
    <comment>Списание не нанесееных КМ. Уничтожен.</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеНеНанесенных_Утерян</name>
    <comment>Списание не нанесееных КМ. Утерян.</comment>
  </enumValues>
  <enumValues>
    <name>ФормированиеНабора</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ</name>
    <comment>RETAIL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратБезКМ_ДистПродажи</name>
    <comment>REMOTE_SALE_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратОтКонечногоПокупателя</name>
    <comment>LEGAL_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ВозвратРанееЭкспортированногоЕАЭС</name>
    <comment>EEC_EXPORT_RETURN</comment>
  </enumValues>
  <enumValues>
    <name>Перемаркировка_ИспорченоЛибоУтеряно</name>
    <comment>KM_SPOILED</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияУпаковки_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Добавление</name>
    <comment>ADDING</comment>
  </enumValues>
  <enumValues>
    <name>ТрансформацияАТК_Изъятие</name>
    <comment>REMOVING</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <comment>Маркировка товаров ИСМП</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.ЛистНабора</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.МаркировкаТоваровИСМП</basedOn>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ВыданныеКодыАгрегаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииИСМП</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортерИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращаемыйТоварБылОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодовSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>фКодыАгрегацийДляПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАгрегации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАгрегации</name>
      <type>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.СписаниеТМЦ</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
        <types>DocumentRef.Машина</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/Маркировка_ПИ/Module.bsl
Функция ИспользоватьПродуктовыйКонтурИСМП() Экспорт
	Возврат (Константы.ИспользоватьПродуктовыйКонтурИСМП.Получить() = Истина);
КонецФункции //ИспользоватьПродуктовыйКонтурИСМП
 
Функция ЭтоМаркируемаяПродукция(ТНВЭД) Экспорт
	Результат = Ложь;
	
	Если ТипЗнч(ТНВЭД) = Тип("СправочникСсылка.ТНВЭД") Тогда
		Результат = ЗначениеЗаполнено(ТНВЭД.ДатаНачалаРаботыСМаркировкой);	
	КонецЕсли; 
	
	Возврат Результат;	
КонецФункции //ЭтоМаркируемаяПродукция(ТНВЭД)

Функция Свойство_ЦветЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("ЦветЧЗ", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_ЦветЧЗ()

Функция Свойство_РазмерныйРядЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("РазмерныйРядЧЗ", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_РазмерныйРядЧЗ() 

Функция Свойство_МатериалЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("Материал", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_МатериалЧЗ()

Функция Свойство_ЦелевойПолЧЗ() Экспорт
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоИмени("ЦелевойПол", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
КонецФункции //Свойство_ЦелевойПолЧЗ()

Функция КаталогВнешнихОтчетов(Клиент = Истина) Экспорт
	Каталог = СокрЛП(Константы.КаталогВнешнихОтчетов.Получить());
	
	РП = ПолучитьРазделительПути();
	Если НЕ СтрЗаканчиваетсяНа(Каталог, РП) Тогда
		Каталог = Каталог + РП;	
	КонецЕсли;
	
	Возврат Каталог;
КонецФункции //КаталогВнешнихОтчетов(Клиент = Истина)

Функция ОрганизацияБТК() Экспорт
	
	Возврат Справочники.Организации.НайтиПоКоду("SSP-99");	

КонецФункции //ОоганизацияЕЕЭ()

Функция ОрганизацияЕЕЭ() Экспорт
	
	Возврат Справочники.Организации.НайтиПоКоду("SS-001");	

КонецФункции //ОоганизацияЕЕЭ()

Функция ПолучитьОТ_Булево() Экспорт

	Возврат Новый ОписаниеТипов("Булево");

КонецФункции // ПолучитьОТ_Булево() 

Функция ПолучитьМенеджер(ИмяТаблицы) Экспорт
	Результат  = Неопределено;	
	
	МетаОбъект = Метаданные.НайтиПоПолномуИмени(ИмяТаблицы);	
	Если МетаОбъект = Неопределено Тогда
		ВызватьИсключение "Не найден объект метаданных: " + ИмяТаблицы;	
	Иначе
		Если Метаданные.Документы.Содержит(МетаОбъект) Тогда
			Коллекция = Документы;
		ИначеЕсли Метаданные.Справочники.Содержит(МетаОбъект) Тогда
			Коллекция = Справочники;
		ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаОбъект) Тогда
			Коллекция = ПланыВидовХарактеристик;
		ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыНакопления;
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыСведений;
		ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыБухгалтерии;
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(МетаОбъект) Тогда
			Коллекция = РегистрыБухгалтерии;
		ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаОбъект) Тогда
			Коллекция = БизнесПроцессы;
		ИначеЕсли Метаданные.Задачи.Содержит(МетаОбъект) Тогда
			Коллекция = Задачи;
		Иначе
			Коллекция = Неопределено;			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Коллекция) Тогда
			Результат = Коллекция[МетаОбъект.Имя];							
		Иначе
			ВызватьИсключение "Не допустимый класс метаданных " + ИмяТаблицы;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьМенеджер(ИмяТаблицы) Экспорт

Функция ФизическоеПодразделениеСклада(Склад) Экспорт
	Результат = Справочники.Подразделения.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Склад) И ТипЗнч(Склад) = Тип("СправочникСсылка.Склады") Тогда
		Реквизиты =	 ПолучитьРеквизитыШапки(Склад, "Подразделение,КодФизическогоУзла");
		
		Если ЗначениеЗаполнено(Реквизиты.КодФизическогоУзла) Тогда
			УзелСклада = УзелПоКоду(Реквизиты.КодФизическогоУзла, "Основной");					
			Если ЗначениеЗаполнено(УзелСклада) Тогда
				Результат = ПолучитьРеквизитШапки(УзелСклада, "Подразделение");			
			КонецЕсли; 
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(Результат) И ЗначениеЗаполнено(Реквизиты.Подразделение) Тогда
			Результат = Реквизиты.Подразделение; 					
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //ФизическоеПодразделениеСклада(Склад) Экспорт 

Функция ИспользоватьУпрБлокировкиСтатусовКМ() Экспорт
	Возврат (Метаданные.РегистрыСведений.СтатусыКМ_Факт.РежимУправленияБлокировкойДанных = Метаданные.СвойстваОбъектов.РежимУправленияБлокировкойДанныхПоУмолчанию.Управляемый);
КонецФункции //ИспользоватьУпрБлокировкиСтатусовКМ() Экспорт

Функция ИспользоватьЗаданияСменыСтатусовНакладной() Экспорт
	
	Возврат Ложь;	

КонецФункции //ИспользоватьЗаданияСменыСтатусовНакладной() Экспорт

Функция ПолучитьДЗРдляМаркировки() Экспорт
	Результат 		= КонецДня(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования() - 7*27*60*60);	
	ПерсональнаяДЗР	= ПолучитьПолномочиеПользователя("ПерсональнаяДатаЗапретаРедактирования", ПараметрыСеанса.Пользователь);	
	Если ЗначениеЗаполнено(ПерсональнаяДЗР) Тогда
		Результат = Мин(ПерсональнаяДЗР, Результат);		
	КонецЕсли; 
	Возврат КонецДня(Результат);
КонецФункции //ПолучитьДЗРдляМаркировки() Экспорт

Функция ИспользоватьРегистрСтатусовКоробокДляБронирования() Экспорт
	Возврат Ложь;
КонецФункции //ИспользоватьРегистрСтатусовКоробокДляБронирования() Экспорт

Функция ЗаписыватьКаждыйЩелчокСканера() Экспорт 
	Возврат Константы.ЗаписыватьКаждыйЩелчокСканера.Получить();
КонецФункции //ЗаписыватьКаждыйЩелчокСканера()

Функция ПолучитьНазначениеПоШК(ДанныеШК) Экспорт
	Возврат Справочники.НазначенияШК.ПолучитьНазначениеПоШК(ДанныеШК);
КонецФункции //НайтиНазначениеКМ(ДанныеШК) Экспорт

Функция ПараметрыГенерацииШКпоУмолчанию() Экспорт
	
	ПараметрыШтрихкода = Новый Структура;
	
	ПараметрыШтрихкода.Вставить("Ширина", 						150);
	ПараметрыШтрихкода.Вставить("Высота", 						150);
	ПараметрыШтрихкода.Вставить("ТипКода", 						99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",				Ложь);
	ПараметрыШтрихкода.Вставить("РазмерШрифта", 				12);
	ПараметрыШтрихкода.Вставить("УголПоворота", 				0);
	ПараметрыШтрихкода.Вставить("Штрихкод",				 		"");
	ПараметрыШтрихкода.Вставить("ПрозрачныйФон", 				Истина);
	ПараметрыШтрихкода.Вставить("УровеньКоррекцииQR",		 	1);
	ПараметрыШтрихкода.Вставить("Масштабировать", 				Ложь);
	ПараметрыШтрихкода.Вставить("СохранятьПропорции", 			Ложь);
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание" , 	1); 
	ПараметрыШтрихкода.Вставить("GS1DatabarКоличествоСтрок", 	2);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 			0);
	ПараметрыШтрихкода.Вставить("УбратьЛишнийФон",	 			Ложь); 
	ПараметрыШтрихкода.Вставить("ЛоготипКартинка");
	ПараметрыШтрихкода.Вставить("ЛоготипРазмерПроцентОтШК");
	
	Возврат ПараметрыШтрихкода;
	
КонецФункции

Функция ДатаОтвалаЧЗ() Экспорт
	Возврат Константы.ДатаОтвалаЧЗ.Получить();	
КонецФункции //ДатаОтвалаЧЗ() Экспорт

Функция ЧЗ_Живой() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ДатаОтвалаЧЗ());
КонецФункции //ЧЗ_Живой() Экспорт

Функция ВыполнятьОнлайнПроверкиКМ() Экспорт
	Возврат Константы.ОнлайнПроверкаКМвЧЗ.Получить();
КонецФункции //ВыполнятьОнлайнПроверкиКМ()

Функция СтатусКМпоРусски(СтатусПоАнглийски) Экспорт
	Результат = СтатусПоАнглийски;
	
	Если ПустаяСтрока(СтатусПоАнглийски) Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Для каждого МетаЗначение Из Метаданные.Перечисления.СтатусыКодовМаркировкиИСМП.ЗначенияПеречисления Цикл
		Если СокрЛП(ВРег(МетаЗначение.Комментарий)) = СокрЛП(ВРег(СтатусПоАнглийски))  Тогда
			Результат = МетаЗначение.Имя;
			Прервать;
		КонецЕсли;	
	КонецЦикла;      
	
	Возврат Результат;	
КонецФункции //СтатусКМпоРусски(СтатусПоАнглийски)

Функция ВремяОжиданияОтветаЧЗ() Экспорт
	Результат = Константы.ВремяОжиданияОтветаЧЗ.Получить();
	Если Результат = 0 Тогда
		Результат = 2;	
	КонецЕсли;
	Возврат Результат;	
КонецФункции //ВремяОжиданияОтветаЧЗ()

Функция ИнтервалПовторногоЗапросаЧЗ() Экспорт
	Результат =  Константы.ИнтервалПовторногоЗапросаЧЗ.Получить();
	Если Результат = 0 Тогда
		Результат = 30*60; //Полчаса по умолчанию	
	КонецЕсли;
	Возврат Результат;
КонецФункции //ИнтервалПовторногоЗапросаЧЗ() Экспорт

Функция ИнтервалМеждуПакетамиПроверки() Экспорт
	Результат =  Константы.ИнтервалМеждуПакетамиПроверки.Получить();
	Если Результат = 0 Тогда
		Результат = 0.2;
	КонецЕсли;
	Возврат Результат;
КонецФункции //ИнтервалПовторногоЗапросаЧЗ() Экспорт

#Область Обмены
//++Данилова Е.В. 04.06.2026 Наряд 0000000256
Функция ПодразделениеПоУзлу(Знач Узел) Экспорт
	
	Результат = Справочники.Подразделения.ПустаяСсылка();

	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Подразделение
	|ИЗ
	|	ПланОбмена.Основной	
	|ГДЕ
	|	ссылка=&Узел
	|УПОРЯДОЧИТЬ ПО 
	|	ПометкаУдаления
	|";

	Запрос.УстановитьПараметр("Узел", Узел);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Подразделение) Тогда
		Результат = Выборка.Подразделение;
	КонецЕсли;

	Возврат Результат;
КонецФункции
//--Данилова Е.В. 04.06.2026 	
Функция КодУзла(Узел) Экспорт	
	Возврат ПолучитьРеквизитШапки(Узел, "Код", "ПланОбмена");
КонецФункции // ()

Функция УзелПоКоду(Код, ИмяПланаОбмена) Экспорт	
	Результат = Неопределено;	
	Если Метаданные.ПланыОбмена.Найти(ИмяПланаОбмена)<>Неопределено Тогда
		Результат = ПланыОбмена[ИмяПланаОбмена].НайтиПокоду(СокрЛП(Код));	
	КонецЕсли; 
	Возврат Результат;
КонецФункции //УзелПоКоду(Код, ИмяПланаОбмена)

Функция ТипТекущегоУзла(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ЭтотУзел(ИмяПланаОбмена).ТипУзла;	
КонецФункции //ТипТекущегоУзла(ИмяПланаОбмена = "Основной") Экспорт

Функция ЭтотУзел(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].ЭтотУзел();	
КонецФункции //ЭтотУзел(ИмяПланаОбмена="ОбменСТЦ")

Функция ЭтотУзел_Код(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат СокрЛП(ПолучитьРеквизитШапки(ПланыОбмена[ИмяПланаОбмена].ЭтотУзел(),"Код","ПланОбмена"));
КонецФункции //ЭтотУзелКод(ИмяПланаОбмена="")

Функция УзелСклада(Склад, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ПланыОбмена[ИмяПланаОбмена].НайтиПоКоду(ПолучитьРеквизитШапки(Склад, "КодФизическогоУзла"));

КонецФункции //УзелСклада(Склад, ИмяПланаОбмена = "Основной")

Функция УзелПодразделения(Подразделение, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Результат = ПланыОбмена[ИмяПланаОбмена].ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка
	|ИЗ
	|	ПланОбмена."+ИмяПланаОбмена+"
	|ГДЕ
	|	Подразделение = &Подразделение
	|";
	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Результат = Выборка.Ссылка;	
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции //УзелПодразделения(Подразделение, Знач ИмяПланаОбмена = "") Экспорт

Функция ИмяПланаОбменаПоУмолчанию()
	Возврат "Основной";
КонецФункции //ИмяПланаОбменаПоУмолчанию()

Функция УправляющийУзел(Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = ИмяПланаОбменаПоУмолчанию();	
	КонецЕсли;
	
	Возврат ЭтотУзел(ИмяПланаОбмена).УправляющийУзел;
КонецФункции //УправляющийУзел(ИмяПланаОбмена = "Основной") Экспорт
 
Функция ПолучитьМассивУзловПоТипу(ТипУзла, Знач ИмяПланаОбмена = "") Экспорт
	Если ПустаяСтрока(ИмяПланаОбмена) Тогда
		ИмяПланаОбмена = "Основной";	
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	ПланОбмена."+ИмяПланаОбмена+"
	|ГДЕ
	|	ТипУзла = &ТипУзла
	|	И НЕ ЭтотУзел
	|	И НЕ ПометкаУдаления
	|";                            
	
	Запрос.УстановитьПараметр("ТипУзла", ТипУзла);	
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция ЭтоНовыйУзелСвертки() Экспорт
	Возврат (СтрНайти(ЭтотУзел_Код("Свертка"), "new") > 0);
КонецФункции //ЭтоНовыйУзелСвертки() Экспорт

#КонецОбласти                                    


// Кухарь А.Ю.  02.04.2025 начало
Функция ЕстьПредварительноСозданыйАгрегат (Накладная) экспорт
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	МаркировкаТоваровИСМП.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.МаркировкаТоваровИСМП КАК МаркировкаТоваровИСМП
	|ГДЕ
	|	МаркировкаТоваровИСМП.ШтрихкодыКоробок.ШтрихкодКоробки <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|	И МаркировкаТоваровИСМП.Проведен
	|	И МаркировкаТоваровИСМП.ВидОперацииИСМП = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.Агрегация)
	|	И МаркировкаТоваровИСМП.ДокументОснование = &Накладная
	|	И МаркировкаТоваровИСМП.ШтрихкодыКоробок.ДокументОснование = НЕОПРЕДЕЛЕНО";
	запрос.УстановитьПараметр("Накладная",Накладная);	
	Выборка = запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() цикл
		возврат Истина;
	КонецЦикла;
	
	Возврат ложь;
	
КонецФункции
Функция ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладнойПИ (Знач Накладная) экспорт
	МаркировкаКС.ПолучитьСтруктуруПравилРаботыСАгрегациейПоНакладной(Накладная);
КонецФункции
// Кухарь А.Ю.  03.04.2025 конец
